---
kind: type
id: T:Autodesk.Revit.DB.TableView
source: html/ba608411-21af-e924-2aa2-3595548ab39f.htm
---
# Autodesk.Revit.DB.TableView

This represents a view that shows a table.
 Most of the layout data for the table is contained in the TableData class.

## Syntax (C#)
```csharp
public class TableView : View
```